Revit 2024 API
ContourSetting.AddContourRange Method
 Add a set of contours as a contour setting item to the current contour setting.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public ContourSettingItem AddContourRange(
	double start,
	double stop,
	double step,
	ElementId subcategoryId
)
Visual Basic
Public Function AddContourRange ( _
	start As Double, _
	stop As Double, _
	step As Double, _
	subcategoryId As ElementId _
) As ContourSettingItem
Visual C++
public:
ContourSettingItem^ AddContourRange(
	double start,
	double stop,
	double step,
	ElementId^ subcategoryId
)
Parameters
start
Type: System.Double
 The contour range start elevation.
stop
Type: System.Double
 The contour range stop elevation. Should be greater than start elevation.
step
Type: System.Double
 The increment elevation of the contour range. Should be greater than zero.
subcategoryId
Type: Autodesk.Revit.DB.ElementId
 The contour line style subcategory id.
Return Value
 The newly added contour setting item.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given value for start is not finite -or- The given value for stop is not finite -or- The given value for step is not finite -or- The input subcategory id is not valid.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The input contour spacing information is not valid.
See Also
ContourSetting Class
Autodesk.Revit.DB Namespace